In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_list = [1,2,3]
arr = np.array([4,5,6])
d = {'a':1,'b':2,'c':3}

In [3]:
pd.Series(data=my_list,index=labels)

a    1
b    2
c    3
dtype: int64

In [5]:
pd.Series(arr,labels)

a    4
b    5
c    6
dtype: int32

In [6]:
pd.Series(my_list)

0    1
1    2
2    3
dtype: int64

In [7]:
pd.Series(arr)

0    4
1    5
2    6
dtype: int32

In [8]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [11]:
print

In [12]:
ser1 = pd.Series([1,2,3,4],index=['a','b','c','d'])

In [13]:
ser1

a    1
b    2
c    3
d    4
dtype: int64

In [14]:
ser2 = pd.Series([4,3,2,1],index=['a','c','d','e'])

In [15]:
ser2

a    4
c    3
d    2
e    1
dtype: int64

In [19]:
ser1['d']

4

In [21]:
ser2['e']

1

In [22]:
ser1 + ser2

a    5.0
b    NaN
c    6.0
d    6.0
e    NaN
dtype: float64

In [23]:
from numpy.random import randn
np.random.seed(101)

In [44]:
df = pd.DataFrame(data = randn(5,6),index=['a','b','c','d','e'],columns=['U','V','W','X','Y','Z'])
df.head()

          U         V         W         X         Y         Z
a  0.081523 -0.415191  0.053661 -2.115113 -0.279510  1.062710
b  1.752014  0.695547  0.153661  0.167638 -0.765930  0.962299
c  0.902826 -0.537909 -1.549671  0.435253  1.259904 -0.447898
d  0.266207  0.412580  0.988773  0.513833 -0.928205  0.846904
e -0.298436  0.029141  0.889031 -1.839261  0.863596 -1.076591

In [30]:
df["W"]

a    0.178009
b    0.330866
c   -1.306482
d   -0.205792
e    0.754121
Name: W, dtype: float64

In [34]:
df[["W","X","Z"]]

          W         X         Z
a  0.178009 -0.626805  1.743477
b  0.330866 -1.063049 -0.945588
c -1.306482 -1.632924 -1.667537
d -0.205792  2.493990  0.496727
e  0.754121 -0.772041  0.688408

In [45]:
df["new"] = df["W"] + df["Z"]

In [37]:
df.head()

          U         V         W         X         Y         Z       new
a -2.736995  1.522562  0.178009 -0.626805 -0.391089  1.743477  1.921486
b  1.130018  0.897796  0.330866 -1.063049 -0.125381 -0.945588 -0.614723
c  2.029544 -1.046358 -1.306482 -1.632924  0.802129 -1.667537 -2.974019
d  0.608857  0.286473 -0.205792  2.493990 -0.547260  0.496727  0.290935
e -1.235614 -0.798428  0.754121 -0.772041 -0.034432  0.688408  1.442530

In [40]:
df.drop("new",axis=1)

          U         V         W         X         Y         Z       new
b  1.130018  0.897796  0.330866 -1.063049 -0.125381 -0.945588 -0.614723
c  2.029544 -1.046358 -1.306482 -1.632924  0.802129 -1.667537 -2.974019
d  0.608857  0.286473 -0.205792  2.493990 -0.547260  0.496727  0.290935
e -1.235614 -0.798428  0.754121 -0.772041 -0.034432  0.688408  1.442530

In [41]:
df

          U         V         W         X         Y         Z       new
a -2.736995  1.522562  0.178009 -0.626805 -0.391089  1.743477  1.921486
b  1.130018  0.897796  0.330866 -1.063049 -0.125381 -0.945588 -0.614723
c  2.029544 -1.046358 -1.306482 -1.632924  0.802129 -1.667537 -2.974019
d  0.608857  0.286473 -0.205792  2.493990 -0.547260  0.496727  0.290935
e -1.235614 -0.798428  0.754121 -0.772041 -0.034432  0.688408  1.442530

In [46]:
df.drop("new",axis=1,inplace=True)

In [47]:
df

          U         V         W         X         Y         Z
a  0.081523 -0.415191  0.053661 -2.115113 -0.279510  1.062710
b  1.752014  0.695547  0.153661  0.167638 -0.765930  0.962299
c  0.902826 -0.537909 -1.549671  0.435253  1.259904 -0.447898
d  0.266207  0.412580  0.988773  0.513833 -0.928205  0.846904
e -0.298436  0.029141  0.889031 -1.839261  0.863596 -1.076591

In [49]:
df.loc["a"]

U    0.081523
V   -0.415191
W    0.053661
X   -2.115113
Y   -0.279510
Z    1.062710
Name: a, dtype: float64

In [50]:
df.U

a    0.081523
b    1.752014
c    0.902826
d    0.266207
e   -0.298436
Name: U, dtype: float64

In [51]:
df["U"]

a    0.081523
b    1.752014
c    0.902826
d    0.266207
e   -0.298436
Name: U, dtype: float64

In [61]:
df[df["U"]>1]

          U         V         W         X        Y         Z
b  1.752014  0.695547  0.153661  0.167638 -0.76593  0.962299

In [64]:
a = "hi i am aaqil rehman"

['hi', 'i', 'am', 'aaqil', 'rehman']

In [66]:
a

'hi i am aaqil rehman'

In [1]:
import pandas as pd
import numpy as np

In [4]:
np.nan

nan

In [7]:
df = pd.DataFrame({
    'A':[1,2,np.nan],
    'B':[3,np.nan,np.nan],
    'C':[4,5,6]
})

In [8]:
df

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [12]:
df.dropna(axis=0)

     A    B  C
0  1.0  3.0  4

In [13]:
df.dropna(axis=1)

   C
0  4
1  5
2  6

In [18]:
df.fillna(value=7,
    method=None,
    axis=1,
    inplace=False,
    limit=None,
    downcast=None,)

     A    B  C
0  1.0  3.0  4
1  2.0  7.0  5
2  7.0  7.0  6

In [19]:
df.fillna(value = df['C'].mean())

     A    B  C
0  1.0  3.0  4
1  2.0  5.0  5
2  5.0  5.0  6

In [20]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)

In [21]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [30]:
df.groupby('Company')

In [23]:
by_company = df.groupby('Company')

In [25]:
by_company.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [26]:
by_company.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [27]:
by_company.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [28]:
by_company.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [31]:
by_company.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [32]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [39]:
by_company.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [37]:
df.describe(include='all')

       Company Person       Sales
count        6      6    6.000000
unique       3      6         NaN
top       MSFT    Sam         NaN
freq         2      1         NaN
mean       NaN    NaN  229.500000
std        NaN    NaN  100.899455
min        NaN    NaN  120.000000
25%        NaN    NaN  143.000000
50%        NaN    NaN  221.500000
75%        NaN    NaN  315.750000
max        NaN    NaN  350.000000

In [40]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [41]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [42]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [44]:
pd.concat([df1,df2,df3],
    axis=0,
    join='outer',
    join_axes=None,
    ignore_index=False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity=False,
    sort=None,
    copy=True,)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [45]:
pd.concat([df1,df2,df3],
    axis=1,
    join='outer',
    join_axes=None,
    ignore_index=False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity=False,
    sort=None,
    copy=True,)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [47]:
df4 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
df5 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [52]:
pd.merge(left=df4,
    right=df5,
    how='inner',
    left_on='key',
    right_on=None,
    left_index=False,
    right_index=False,
    sort=False,
    suffixes=('_x', '_y'),
    copy=True,
    indicator=False,
    validate=None,)

TypeError: object of type 'NoneType' has no len()

In [53]:
df6 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
df7 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [54]:
pd.merge(left=df6,
    right=df7,
    how='inner',
    on=['key1','key2'],
    left_on=None,
    right_on=None,
    left_index=False,
    right_index=False,
    sort=False,
    suffixes=('_x', '_y'),
    copy=True,
    indicator=False,
    validate=None,)

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [55]:
pd.merge(left=df6,
    right=df7,
    how='outer',
    on=['key1','key2'],
    left_on=None,
    right_on=None,
    left_index=False,
    right_index=False,
    sort=False,
    suffixes=('_x', '_y'),
    copy=True,
    indicator=False,
    validate=None,)

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [56]:
pd.merge(left=df6,
    right=df7,
    how='right',
    on=['key1','key2'],
    left_on=None,
    right_on=None,
    left_index=False,
    right_index=False,
    sort=False,
    suffixes=('_x', '_y'),
    copy=True,
    indicator=False,
    validate=None,)

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [57]:
pd.merge(left=df6,
    right=df7,
    how='left',
    on=['key1','key2'],
    left_on=None,
    right_on=None,
    left_index=False,
    right_index=False,
    sort=False,
    suffixes=('_x', '_y'),
    copy=True,
    indicator=False,
    validate=None,)

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [58]:
df8 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

df9 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [61]:
df8.join(other=df9, on=None, how='left', lsuffix='', rsuffix='', sort=False)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [62]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [63]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [64]:
df['col2'].nunique()

3

In [65]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [72]:
new_df = df[(df['col1']>2)  & (df['col2']==444)]

In [73]:
new_df

   col1  col2 col3
3     4   444  xyz

In [77]:
def times2(x):
    return x*2

def times3(x):
    return x*3

In [79]:
df['col2'].apply(times3)

0    1332
1    1665
2    1998
3    1332
Name: col2, dtype: int64

In [80]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [81]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [82]:
df['col2'].sum()

2109

In [83]:
df['col2'].max()

666

In [84]:
df['col2'].min()

444

In [85]:
df['col2'].mode()

0    444
dtype: int64

In [86]:
df['col2'].std()

106.27440896095354

In [87]:
del df['col1']

In [88]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [90]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [91]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [93]:
df.sort_values(by = 'col2', ascending=True)

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [94]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [95]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [96]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [98]:
df.fillna('Fill NA')

      col1     col2 col3
0        1  Fill NA  abc
1        2      555  def
2        3      666  ghi
3  Fill NA      444  xyz

In [99]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [100]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [101]:
pd.pivot_table(data=df,values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN